[
  {
    "Date": "11/16/2024",
    "Year": 2001,
    "Event": "Harry Potter and the Philosopher's Stone released",
    "Description": "The film version of the popular book by the same name written by author J. K. Rowling starred Daniel Radcliffe as Harry Potter and followed Potter's first year at Hogwarts, a school for magic."
  },
  {
    "Date": "11/16/2024",
    "Year": 1988,
    "Event": "Estonians declare sovereignty from USSR",
    "Description": "Estonians issued the Estonian Sovereignty Declaration as part of the Singing Revolution. The Declaration declared Estonian sovereignty from the Soviet Union and declared Estonian laws paramount over Soviet laws. The day is now celebrated as the Day of Declaration of Sovereignty."
  },
  {
    "Date": "11/16/2024",
    "Year": 1965,
    "Event": "Soviets launch Venera 3",
    "Description": "Part of the Venera program, it was the first space probe to land on another planet - Venus. Unfortunately, due to technical issues, it was not able to send any data back to Earth. The first space probe to send data from another planet to Earth was Venera 7."
  },
  {
    "Date": "11/16/2024",
    "Year": 1945,
    "Event": "UNESCO founded",
    "Description": "The United Nations Educational, Scientific and Cultural Organization is a special branch of the United Nations which promotes peace and well-being through education, scientific collaboration and cultural understanding and exchange. It is headquartered in Paris, France and has 195 state members."
  },
  {
    "Date": "11/16/2024",
    "Year": 1940,
    "Event": "Warsaw ghetto sealed",
    "Description": "The largest Jewish ghetto in Nazi-occupied Poland, the Warsaw ghetto, was created in October 1940 by a German decree. According to the decree, all Jews in the city had to move to the ghetto, which was closed off by a 10 feet wall and had soldiers and police guarding it from the outside 24 hours a day. The ghetto was the scene of one of the largest Jewish uprisings during the Second World War in 1943."
  },
  {
    "Date": "11/17/2024",
    "Year": 2003,
    "Event": "Arnold Schwarzenegger sworn in as Californian Governor",
    "Description": "The bodybuilder and actor best known for his role as a cyborg in the science fiction movie, The Terminator, replaced then Governor Gray Davis. Schwarzenegger was elected for another term as governor in 2007."
  },
  {
    "Date": "11/17/2024",
    "Year": 1989,
    "Event": "Velvet Revolution begins",
    "Description": "A week after the fall of the Berlin Wall, a demonstration of by students commemorating International Students Day in Prague was violently shut down by riot police. The incident led to mass strikes and nonviolent around the country that ended communist rule in erstwhile Czechoslovakia and paved the way for the first democratic elections in the country in 41 years."
  },
  {
    "Date": "11/17/2024",
    "Year": 1973,
    "Event": "Athens Polytechnic Uprising Ends",
    "Description": "The popular protests against the military junta under Georgios Papadopoulos began on November 14 when students at the polytechnic went on a strike. On the morning of November 17, the military crashed into the campus grounds using a tank and put an end of the protests. While no one was thought to have been killed on the polytechnic campus, many people were killed in clashes around the city. Today, all schools and universities are closed on November 17 to commemorate the uprising."
  },
  {
    "Date": "11/17/2024",
    "Year": 1869,
    "Event": "Construction on Suez Canal finished",
    "Description": "The 120 miles (193 kms) long artificial waterway connecting the Red Sea and the Mediterranean Sea took 10 years to be built and was opened to ships. The canal connected Europe to Asia without ships having to go all the way around Africa."
  },
  {
    "Date": "11/17/2024",
    "Year": 1858,
    "Event": "The start of Modified Julian Date",
    "Description": "Mostly used by astronomers and astrophysicists, the Modified Julian Date (MJD) is a dating method that is defined by subtracting 2,400,000.5 days from the current Julian date (JD), which is calculated by counting the number of days past since Noon January 1, 4713 B.C.E. The MJD gives the number of days past Midnight November 17, 1858. MJD was first used in 1957 by scientists at the Smithsonian Astrophysical Observatory to track satellites."
  },
  {
    "Date": "11/18/2024",
    "Year": 1978,
    "Event": "Mass suicides in Jonestown",
    "Description": "Over 900 people committed suicide at the behest of Jim Jones the founder and head of a group called Peoples Temple. Formed in Indianapolis, Indiana, in the mid-1050s, members of the group moved to Guyana in 1974 and set up a settlement outside Georgetown and called in Jonestown."
  },
  {
    "Date": "11/18/2024",
    "Year": 1963,
    "Event": "Push button phones are used for the first time",
    "Description": "Bell systems started replacing rotary dial phones by push button phone in the United States. Push button phones use keys or buttons to dial a number."
  },
  {
    "Date": "11/18/2024",
    "Year": 1916,
    "Event": "End of the Somme Offensive",
    "Description": "The battle was bought between German forces on one side and British and French forces on the other during the First World War. Thought to be one of the bloodiest battles of the 20th century - the conflict started on July 1, 1916, and was fought on the banks of the river Somme in France."
  },
  {
    "Date": "11/18/2024",
    "Year": 1903,
    "Event": "Hay-Bunau-Varilla Treaty signed between Panama and the US",
    "Description": "The treaty created the Panama Canal Zone and set up the terms for the construction of the Panama Canal. Until 1979, the Panama Canal Zone was a territory of the United States. The French began construction on the Panama Canal in 1881 but had to stop due to engineering problems. The US took over the construction in 1904 and finished building the canal in 1914."
  },
  {
    "Date": "11/18/2024",
    "Year": 1883,
    "Event": "Canadian and American railroads adopt time zones",
    "Description": "Prior to this, most cities had their own local time, making it difficult for railways to be on time and confusing passengers. To solve this problem, private railways decided to divide the continent into 4 distinct time zones - the lines of which are very close to the time zone lines today."
  },
  {
    "Date": "11/19/2024",
    "Year": 1977,
    "Event": "Egyptian president Anwar Sadat visits Israel",
    "Description": "Sadat was the first Arab head of state to visit Israel and address the Israeli parliament, the Knesset. His visit came under severe criticism both in Israel and in the Arab world. Sadat and Israeli prime minister Menachem Begin were jointly awarded the Nobel Peace Prize in 1978 for their attempts to bring a resolution to the Arab-Israeli conflict."
  },
  {
    "Date": "11/19/2024",
    "Year": 1969,
    "Event": "Pelé’s 1000th goal",
    "Description": "The Brazilian footballer, often considered to be the greatest athlete of the 20th century, made his 1,000th professional goal against Vasco da Gama at the Maracana stadium in Rio de Janeiro."
  },
  {
    "Date": "11/19/2024",
    "Year": 1863,
    "Event": "Gettysburg Address",
    "Description": "Thought to be one of the most memorable and influential speeches in the history of the United States, the address was delivered by American President Abraham Lincoln while dedicating the Soldiers' National Cemetery in Gettysburg, Pennsylvania, 4 months after the bloody Battle of Gettysburg. The short address which was only 272 words in length, emphasized that the American Civil War wasn’t just a war to save the union, but also a war to ensure equality and freedom."
  },
  {
    "Date": "11/19/2024",
    "Year": 1943,
    "Event": "Janowska camp uprising",
    "Description": "The concentration camp in occupied Poland was set up in 1941. In November 1943, in anticipation of the advancement of Soviet troops, the Nazis tried to evacuate the camp and used the inmates to remove traces of executions and mass killings in the past. On this day, the inmates staged an uprising and attempted to escape. Most escapees, however, were recaptured and killed."
  },
  {
    "Date": "11/19/2024",
    "Year": 1794,
    "Event": "Signing of the Jay Treaty",
    "Description": "The treaty, officially known as, Treaty of Amity Commerce and Navigation, between His Britannic Majesty and The United States of America, was signed between representatives of the United States and Britain. It called for the British to surrender northwestern posts to the U.S. and for them to consider the United States as a most favored nation for trade between the two countries."
  },
  {
    "Date": "11/20/2024",
    "Year": 1998,
    "Event": "First module of the International Space Station launched",
    "Description": "Called Zarya, the module is Russian-built and American owned. The International Space Station (ISS) is a manned artificial satellite was built and operated by 5 space agencies – the Canadian Space Agency, the European Space Agency, US’s NASA, Russia's Roscosmos, and the Japanese Aerospace Exploration Agency. The brightest man-made object visible to the naked eye from Earth, ISS orbits the Earth at a speed of 17,500 miles per hour (28,000 kilometers per hour) at an average distance of 248 miles (400 kilometers) from Earth."
  },
  {
    "Date": "11/20/2024",
    "Year": 1985,
    "Event": "Windows 1.0 released",
    "Description": "Nearly two years after it was announced, Microsoft released its first graphical operating system. The OS made it easier for users to navigate on their computer screens. It came with Paint, Notepad, Calculator and a game called Reversi."
  },
  {
    "Date": "11/20/2024",
    "Year": 1959,
    "Event": "Declaration of the Rights of the Child",
    "Description": "The United Nations General Assembly adopted the document that laid out the rights of children around the world. The day is also annually celebrated as Universal Children's Day."
  },
  {
    "Date": "11/20/2024",
    "Year": 1945,
    "Event": "Nuremberg trials begin",
    "Description": "The trials were led by the International Military Tribunal and were held to prosecute high-ranking members of the Nazi party for war crimes committed during the Second World War. Of the 23 people tried, 14 were sentenced to death."
  },
  {
    "Date": "11/20/2024",
    "Year": 1923,
    "Event": "Traffic signal patented",
    "Description": "American Garret Morgan was awarded the patent for an automated traffic signal. Morgan’s invention was not the first of its kind, but unlike the other traffic signals which just had stop and go signals, his traffic light had a third signal that warned drivers about changes in the stop and go lights. This signal was the precursor for today’s yellow light."
  },
  {
    "Date": "11/21/2024",
    "Year": 1979,
    "Event": "Mob burns down US embassy in Pakistan",
    "Description": "The mob was allegedly incensed by a rumor that the United States was involved in an attack on a mosque in the holy city of Mecca."
  },
  {
    "Date": "11/21/2024",
    "Year": 1964,
    "Event": "Verrazano Narrows Bridge opens in NYC",
    "Description": "The suspension bridge connects Staten Island and Brooklyn in New York City and at the time of its opening, it was the world’s longest suspension bridge, until the Humber Bridge in the UK opened in 1981."
  },
  {
    "Date": "11/21/2024",
    "Year": 1962,
    "Event": "War between China and India ends",
    "Description": "The month long war began over a border dispute between the two countries and ended with a unilateral ceasefire by the Chinese."
  },
  {
    "Date": "11/21/2024",
    "Year": 1941,
    "Event": "Tweety Bird makes its debut",
    "Description": "The fictional cartoon canary also just called Tweety made his first appearance in A Tale of Two Kitties, a Warner Bros. Merrie Melodies cartoon. Tweety was created by animator Bob Clampett who worked on Loony Tunes cartoons."
  },
  {
    "Date": "11/21/2024",
    "Year": 1920,
    "Event": "Bloody Sunday in Ireland",
    "Description": "A key event in the Irish War of Independence, which was a conflict between the British government and Irish revolutionaries in Ireland, Bloody Sunday began with the killings of 14 people by the Irish Republican Army (IRA) under the leadership of Michael Collins. Two other violent incidents against civilian and IRA members during the day added to the death count, which was over 30 by the end of the day."
  },
  {
    "Date": "11/22/2024",
    "Year": 2005,
    "Event": "Angela Merkel takes office as German Chancellor",
    "Description": "The physical chemist from former East Germany became the first female chancellor of the country."
  },
  {
    "Date": "11/22/2024",
    "Year": 2004,
    "Event": "Orange Revolution begins in Ukraine",
    "Description": "The revolution began after an election that was marred by widespread rumors of corruption and fraud. The protests resulted in electoral reforms in the country and November 22 was declared a Day of Freedom in 2005. The holiday was then moved to January 22 in 2011."
  },
  {
    "Date": "11/22/2024",
    "Year": 1995,
    "Event": "Toy Story released",
    "Description": "Produced by Pixar, the movie which follows the adventures of human-like toys, was the world’s first feature-length computer-animated movie. Considered to be one of the best animated films every released, Toy story won 3 Oscars including Best Original Screenplay, Best Original Score, and Best Original Song."
  },
  {
    "Date": "11/22/2024",
    "Year": 1986,
    "Event": "Mike Tyson wins fight against Trevor Berbick",
    "Description": "The victory won Tyson the World Boxing Council (WBC) heavyweight championship and made him world’s youngest heavyweight champion at the age of 20 years."
  },
  {
    "Date": "11/22/2024",
    "Year": 1963,
    "Event": "John F. Kennedy assassinated",
    "Description": "The 35th President of the United States was shot by Lee Harvey Oswald, while traveling in a motorcade in Dallas, Texas. He was the 4th American president to be assassinated while in office. The other 3 were Abraham Lincoln, James Abram Garfield, and William McKinley."
  },
  {
    "Date": "11/23/2024",
    "Year": 2009,
    "Event": "Maguindanao massacre in the Philippines",
    "Description": "Considered to be the worst attack on journalists in recorded history, the massacre occurred in the southern Philippines, when 57 citizens and journalists en route to register voters in Esmael Mangudadatu for the upcoming gubernatorial elections, were killed by gunmen and buried. 34 journalists were killed on the day."
  },
  {
    "Date": "11/23/2024",
    "Year": 2005,
    "Event": "Ellen Johnson Sirleaf elected as President of Liberia",
    "Description": "The 2011 Nobel Peace Prize winner is also the first woman to be elected as head of state in an African country."
  },
  {
    "Date": "11/23/2024",
    "Year": 1976,
    "Event": "First person to dive 100 meters in the sea without breathing equipment",
    "Description": "Frenchman Jacques Mayol, who is also sometimes known as Dolphin Man, was 49 years old at the time. He broke his own record 7 years later by diving 105 meters."
  },
  {
    "Date": "11/23/2024",
    "Year": 1963,
    "Event": "Doctor Who debuts on TV",
    "Description": "The longest running science fiction TV show first aired with an episode called An Unearthly Child on the British Broadcasting Channel. The show that has had 11 different actors play the lead role, follows the time-traveling adventures of Doctor Who, who uses the Time and Relative Dimension in Space or TARDIS to jump around in time and space."
  },
  {
    "Date": "11/23/2024",
    "Year": 1910,
    "Event": "Last person to be executed in Sweden",
    "Description": "Johan Alfred Ander was convicted of murdering Victoria Hellsten during a robbery of a currency exchange. He was the only person in Swedish history to be executed using a guillotine. Capital punishment in the country was abolished for all peacetime crimes in 1921 and for all crimes in 1973."
  },
  {
    "Date": "11/24/2024",
    "Year": 2012,
    "Event": "Fire breaks out in a clothing factory in Dhaka",
    "Description": "Over 110 people were killed and about 200 people were injured at the Tazreen Fashion factory on the outskirts of Dhaka, Bangladesh. The tragedy brought to light poor working conditions of workers who made export clothing in Bangladesh. It also led to major labor reforms in the country and in the fashion world, which promised to take steps to ethically source their products."
  },
  {
    "Date": "11/24/2024",
    "Year": 1971,
    "Event": "Hijacking of Northwest Orient Airline 305",
    "Description": "Considered to be one of the only unsolved hijacking cases in American history, a man named DB Cooper or Dan Cooper hijacked the Seattle, Washington bound plane. After his demands of $ 200,000 in cash and parachutes were fulfilled at the Seattle airport, he released the passengers, refueled the airplane and asked to be flown to Mexico. On the way, however, he used a parachute to escape from the plane. Cooper has never been identified or caught."
  },
  {
    "Date": "11/24/2024",
    "Year": 1963,
    "Event": "Lee Harvey Oswald shot",
    "Description": "Oswald had assassinated John F. Kennedy, the 35th American president, two days prior to being shot by Jack Ruby while being transported by the police. The murder was broadcasted live on TV."
  },
  {
    "Date": "11/24/2024",
    "Year": 1877,
    "Event": "Black Beauty is published",
    "Description": "The classic novel about the life of a horse called Black Beauty was written by English author Anna Sewell. The book quickly gained popularity and became an important part in the animal rights movement. It was Sewell’s only published work."
  },
  {
    "Date": "11/24/2024",
    "Year": 1859,
    "Event": "Charles Darwin’s Origin of Species published",
    "Description": "One of the most influential books of all times, On the Origin of Species, put forth the theory of evolution and described the process of natural selection."
  },
  {
    "Date": "11/25/2024",
    "Year": 1973,
    "Event": "Military coup in Greece",
    "Description": "President George Papadopoulos was ousted by the army, just a week after student-led protests at the Athens Polytechnic were violently put down by the government."
  },
  {
    "Date": "11/25/2024",
    "Year": 1960,
    "Event": "Assassination of the Mirabal Sisters",
    "Description": "The 3 Dominican sisters, Patria, Minerva, Antonia Mirabal, were activists that were opposed to the dictatorship of Rafael Trujillo. On this day, they were brutally killed and their deaths staged to look like accidents. In 1999, the United Nations General Assembly declared November 25 as the International Day for the Elimination of Violence against Women."
  },
  {
    "Date": "11/25/2024",
    "Year": 1952,
    "Event": "Agatha Christie’s The Mousetrap opens at London’s West End",
    "Description": "The longest running show in history, the play began as a radio play called Three Blind Mice. It is based on the death of Dennis O'Neill, who died while in foster care."
  },
  {
    "Date": "11/25/2024",
    "Year": 1950,
    "Event": "“Storm of the century” hits eastern US",
    "Description": "Also known as the Appalachian Storm, the storm reached blizzard conditions and dumped nearly 60 inches of snow in the Appalachian area. It brought unseasonal temperatures to the region and caused widespread damage to property. About 150 people were thought to have been killed as a result of it."
  },
  {
    "Date": "11/25/2024",
    "Year": 1936,
    "Event": "Nazi Germany and Japan sign the Anti-Comintern Pact",
    "Description": "The treaty was directed towards the Soviet Union and stipulated that in case of Soviet aggression towards either country, the other would consider it as an act of aggression towards it as well. The pact was later signed by other countries including Italy, Romania, Spain, and Turkey."
  },
  {
    "Date": "11/26/2024",
    "Year": 2003,
    "Event": "Concorde retired from service",
    "Description": "Concorde retired from service after 27 years of flight"
  },
  {
    "Date": "11/26/2024",
    "Year": 1983,
    "Event": "Brink’s Mat gold heist",
    "Description": "The £ 26 million robbery took place in a Brink Mat warehouse at Heathrow Airport in London. The stolen gold, diamonds and cash has never been recovered."
  },
  {
    "Date": "11/26/2024",
    "Year": 1966,
    "Event": "World’s first tidal power station opens in France",
    "Description": "The Rance Tidal Power Station on the Rance River in Brittany, France was inaugurated by French president Charles de Gaulle. Today, it is one of the largest tidal power stations in the world."
  },
  {
    "Date": "11/26/2024",
    "Year": 1965,
    "Event": "France launches Astérix",
    "Description": "The launch of the satellite from Hammaguir, Algeria made France the 6th country in the world after the US, the USSR, the UK, Canada, and Italy to have an artificial satellite in orbit. The satellite is named after the Asterix the popular comic character created by French writer René Goscinny."
  },
  {
    "Date": "11/26/2024",
    "Year": 1942,
    "Event": "Casablanca premiers",
    "Description": "The classic movie starring Ingrid Bergman and Humphrey Bogart won 3 Oscars – Best Picture, Director and Adapted Screenplay. The film, which is set during the Second World War, follows the life of Rick Blaine, a former freedom fighter and a club owner in Casablanca, Morocco, who has to choose between his love for a woman, Ilsa Lund, and saving her husband from the Nazis."
  },
  {
    "Date": "11/27/2024",
    "Year": 2005,
    "Event": "World’s first successful partial face transplant",
    "Description": "Drs Bernard Devauchelle, Benoit Lengelé, and Jean-Michel Dubernard used donor tissue to reconstruct the face of Isabelle Dinoire in Amiens, France. Isabelle Dinoire’s face had been mauled by a dog."
  },
  {
    "Date": "11/27/2024",
    "Year": 2001,
    "Event": "Hubble detects the first planetary atmosphere outside the Solar System",
    "Description": "The space telescope detected sodium on HD 209458 b, an exoplanet also known as Osiris. Belonging to a class of planets called hot Jupiter, because they are similar in size to Jupiter. Unlike Jupiter, however, these planets orbit very close to their stars and consequently have very high temperatures on their surfaces."
  },
  {
    "Date": "11/27/2024",
    "Year": 1989,
    "Event": "World’s first living liver transplant",
    "Description": "21-month old Alyssa Smith became the first person to receive a liver transplant from a living donor, her mother Teresa Smith at the University of Chicago Medical Center. The transplant occurred under the supervision of surgeons Christoph Broelsch, Richard Thistlethwaite, Thomas Heffron, and Jean Emond."
  },
  {
    "Date": "11/27/2024",
    "Year": 1978,
    "Event": "Harvey Milk and George Moscone are assassinated",
    "Description": "Milk was the first openly-gay person to be elected in local government in California. He and George Moscone, San Francisco's mayor at the time, were killed by a former member of the San Francisco Board of Supervisors."
  },
  {
    "Date": "11/27/2024",
    "Year": 1895,
    "Event": "Alfred Nobel signes his last will",
    "Description": "Alfred Nobel signed his last will which called for his estate and fortune that he made as the inventor of dynamite to be used for creating awards for those who contributed to the benefit of mankind. The will created 5 awards - in physics, chemistry, medicine, literature and peace, and was signed in the Swedish–Norwegian Club in Paris."
  },
  {
    "Date": "11/28/2024",
    "Year": 1991,
    "Event": "South Ossetia declares independence",
    "Description": "The disputed region of the country of Georgia calls itself the Republic of South Ossetia. The declaration of independence was not recognized by Georgia and was followed by the South Ossetia War. Only a few countries, including Russia and Venezuela, recognize it as a sovereign country."
  },
  {
    "Date": "11/28/2024",
    "Year": 1975,
    "Event": "East Timor independence",
    "Description": "East Timor declared its independence from Portugal"
  },
  {
    "Date": "11/28/2024",
    "Year": 1967,
    "Event": "First pulsar observed",
    "Description": "Graduate student Jocelyn Bell and her advisor Antony Hewish at Cambridge University were the first people to observe and discover pulsars. Pulsars are rapidly spinning neutron magnetized stars that emit radiation."
  },
  {
    "Date": "11/28/2024",
    "Year": 1964,
    "Event": "NASA launches Mariner 4",
    "Description": "The first spacecraft to make a flyby of Mars, the spacecraft was the first one to send images of a planet back to Earth."
  },
  {
    "Date": "11/28/2024",
    "Year": 1943,
    "Event": "Tehran Conference begins",
    "Description": "The Tehran Conference between the US, the UK and the Soviet Union began at the Soviet Embassy in Tehran. The conference dealt with the Axis powers in Europe and Asia and made plans to open up a second front against the Germans in France during WW II."
  },
  {
    "Date": "11/29/2024",
    "Year": 1972,
    "Event": "Atari Releases Pong",
    "Description": "One of the very first arcade games to hit the market, Pong was a 1 or 2 player video game similar to tennis, where the goal is to use a paddle to hit a ball. Around 35000 Pong consoles were sold around the world."
  },
  {
    "Date": "11/29/2024",
    "Year": 1951,
    "Event": "Silent Coup in Thailand",
    "Description": "The Thai military took over the country's governance and reinstated the 1932 Constitution."
  },
  {
    "Date": "11/29/2024",
    "Year": 1929,
    "Event": "First flight over the South Pole",
    "Description": "American explorer Richard Byrd became the first person to fly over the South Pole. The flight took just over 18 hours. 3 years ago, Byrd flew over the North Pole, though there is some debate whether he actually accomplished the feat."
  },
  {
    "Date": "11/29/2024",
    "Year": 1899,
    "Event": "FC Barcelona founded",
    "Description": "The popular football (soccer) club was founded by footballer Hans Gamper. Informally known as Barça, the club is thought to be one of the top 5 richest football clubs in the world. The club has won 4 European Cups (1978-79, 1981-82, 1988-89, 1996-97) and is a 5 time Champions League winner (1991-92, 2005-06, 2008-09, 2010-11, 2014-15)."
  },
  {
    "Date": "11/29/2024",
    "Year": 1777,
    "Event": "City of San Jose Founded",
    "Description": "The first city to be settled in California, San Jose was founded as San José de Guadalupe. Before the Spanish settled in the city, the area was inhabitated by the Ohlone people. San Jose was the first capital of the state of California, which was established in 1850."
  },
  {
    "Date": "11/30/2024",
    "Year": 1982,
    "Event": "Michael Jackson’s Thriller is released worldwide",
    "Description": "Thought to be the best selling album of all time, the album, which had 9 tracks, won 8 Grammy Awards, including the award for Album of the Year in 1984."
  },
  {
    "Date": "11/30/2024",
    "Year": 1947,
    "Event": "Civil War in Palestine",
    "Description": "Also known as the Civil War in Mandatory Palestine, the conflict began the day after the United Nations General Assembly voted on a resolution that provided a partition plan for Palestine. The war was wracked by violence which began on November 30 after two buses full of Israeli passengers were attacked by Arab gunmen and snipers shot pedestrians in Tel Aviv. On May 14, Israel declared itself an independent state and on May 15, the Civil War turned into a regional war after a coalition of Arab states that included Egypt, Jordan, and Syria, joined the conflict."
  },
  {
    "Date": "11/30/2024",
    "Year": 1940,
    "Event": "Stars of I Love Lucy marry",
    "Description": "Lucille Ball and Desi Arnaz of the popular American comedy sitcoms, I Love Lucy and The Lucy and Desi Comedy Show married in real life. They were married for 20 years."
  },
  {
    "Date": "11/30/2024",
    "Year": 1939,
    "Event": "The Winter War begins",
    "Description": "The 4-month long war between Finland and the Soviet Union began after the USSR invaded Finland and bombed Helsinki. The conflict ended on March 30, 1940, with the two countries signing the Moscow Peace Treaty. In retaliation for its actions, the Soviet Union was expelled from the League of Nations."
  },
  {
    "Date": "11/30/2024",
    "Year": 1872,
    "Event": "First international football (soccer) match",
    "Description": "The match between England and Scotland was held at West of Scotland Cricket Club in Partick, Scotland. The game ended with a 0-0 draw."
  },
  {
    "Date": "12/1/2024",
    "Year": 2009,
    "Event": "Treaty of Lisbon comes into force",
    "Description": "The Treaty of Lisbon, which amended the two treaties - the Maastricht Treaty and the Treaty of Rome - that form the constitutional basis of the European Union came into force after being signed by 13 countries in 2007."
  },
  {
    "Date": "12/1/2024",
    "Year": 1958,
    "Event": "French colony of Ubangi-Shari gains autonomy",
    "Description": "The French colony of Ubangi-Shari, now known as the Central African Republic, gained autonomy from France. 2 years later, the country became independent and adopted its current name."
  },
  {
    "Date": "12/1/2024",
    "Year": 1943,
    "Event": "Tehran Conference ends",
    "Description": "The Tehran Conference between the US, the UK, and the Soviet Union ended with the three countries deciding to open up a second front against Germany in France, and the Soviet Union agreeing to declare war against Japan."
  },
  {
    "Date": "12/1/2024",
    "Year": 1919,
    "Event": "Nancy Astor becomes to the first woman to join the British House of Commons",
    "Description": "Nancy Witcher Langhorne also known as Nancy Astor became the first woman to join the British House of Commons."
  },
  {
    "Date": "12/1/2024",
    "Year": 1918,
    "Event": "Kingdom of Iceland established",
    "Description": "The Kingdom of Iceland was established with the signing of the Act of Union with Denmark. The act recognized Iceland as a sovereign state under a common monarch with Denmark, and the Kingdom lasted until 1944 when a national referendum created the Republic of Iceland."
  }
]